backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 40]
      dtype: float32
      name: embedding_1_input
      ragged: false
      sparse: false
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 40]
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config: {maxval: 0.05, minval: -0.05, seed: null}
      embeddings_regularizer: null
      input_dim: 5000
      input_length: 40
      mask_zero: false
      name: embedding_1
      output_dim: 80
      trainable: true
  - class_name: Bidirectional
    config:
      dtype: float32
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.0
          dtype: float32
          go_backwards: false
          implementation: 2
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config: {seed: null}
          kernel_regularizer: null
          name: lstm_1
          recurrent_activation: sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.0
          recurrent_initializer:
            class_name: Orthogonal
            config: {gain: 1.0, seed: null}
          recurrent_regularizer: null
          return_sequences: false
          return_state: false
          stateful: false
          time_major: false
          trainable: true
          unit_forget_bias: true
          units: 100
          unroll: false
          use_bias: true
      merge_mode: concat
      name: bidirectional
      trainable: true
  - class_name: Dropout
    config: {dtype: float32, name: dropout, noise_shape: null, rate: 0.1, seed: null,
      trainable: true}
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 1
      use_bias: true
  name: sequential_1
keras_version: 2.4.0
